namespace DNDCatalog.Core.SpellAggregate;

public enum SpellSchool
{
    Abjuration = 1, //Огородження - магическая защита, ограждение, Преграждение
    Conjuration,    //Виклику - призыв и создание
    Divination,     //Віщування - предсказание, Прорицание
    Enchantment,    //Причарування - чары, наложение долгосрочных эффектов, Очарование
    Evocation,      //Втілення - Invocation (инвокация, краткосрочные эффекты, включая большинство боевых чар вроде удара молнии) Воплощение
    Illusion,       //Ілюзії - иллюзии
    Necromancy,     //Некромантії - некромантия, манипулирование жизненной энергией
    Transmutation   //Видозміни - Alteration (изменение, преобразование) Трансмутация
}
